<?
    $this->Define("enum-state_t","ru", "
    up - поток активен, сервер захватывает поток
    down - поток не активен, сервер не будет захватывать поток всвязи с проблемами подключения
    reconnect - сервер осуществляет переподключение к потоку
    suspend - поток не активен, сервер ожидает внешнего сигнала для захвата потока. (Возможно только воспроизведение DVR)
    transfer - поток не активен, происходит перенос потока на другой сервер.  (Возможно только воспроизведение DVR)
    complete - поток не активен, перенос потока на другой сервер завершен.  (Возможно только воспроизведение DVR)
    invalid - ошибка потока, сервер не будет переподключаться к потоку.
    pending - поток не активен, сервер ожидает ответа от камеры");

    $this->Define("enum-ondemand_t","ru", "
    pending - в данный момент запись DVR не осуществляется, 
    recording - идет запись DVR, 
    flushing - DVR записвыается на диск");

    $this->Define("enum-tracks_t","ru", "
    video - Канал видеоданных
    audio - Канал аудиоданных
    events - Канал событий
    application - Канал данных приложения (Onvif и т.д.)");

    $this->Define("enum-access_t","ru", "
    none - Подключение к потоку клиентов для просмотра - невозможно. При этому функции захвата и работы через API доступны.
    public - Авторизация клиента не требуется. Общедоступный поток, любой клиент может просматривать поток с разрешенных IP-адресов.
    protected - Подключение к потоку требует авторизации с использование имени пользователя и пароля.
    private - Подключение к потоку требует токен авторизации {@see:Aipix/Media server/Web API/Authorization/CreateAccessToken}");

    $this->Define("enum-webauth_t","ru", "
    basic - Basic авторизация с использованием имени пользорвателя и пароля
    digest - Digest авторизация с использованием имени пользорвателя и пароля");

    $this->Define("enum-nodestate_t","ru", "
    undefined - Состояние не определено. Пока небыло полученое сообщение о состоянии ноды.
    unavailable - Нода недоступна. Одна из причин, неверно имя хоста ноды или ее адрес {@see:Aipix/Media server/Конфигурирование/Cервер (server.yaml)}
    warming - Состояние не получено. Не истекло время ожидания поднятия ноды после рестарта сервера.
    active - Нода активна.
    invalid - Неверные состояние ноды.
    down - Нода перестла быть доступной. Исчерпано количество попыток опредлить ее состояние.
    ");

    $this->Define("enum-broadcast_t","ru", "
    rtsp - Протокол передачи данных в реальном времени {@see:'Aipix/Media server/Потоки видеокамер/Поддерживаемые протоколы воспроизведения'}
    hls - Web совместимый формат воспроизведение медиа. Может вносить некоторую задержку ( опоздание ) относительно реального времени.
    ");

    $this->Define("enum-dvr_type_t","ru", "
    false - Запрещает хранение и запись потока.
    true - Разрешает запись и хранение копии потока.
    ondemand - Запись DVR по событиям генерируемыми исходным потоком (Onvif - события) или API {@see:Aipix/Media server/Web API/Streams/Events/TriggerEvent}. Подробнее о режиме работы {@see:Aipix/Media server/DVR/Запись по событиям}
    ");
?>